import random

print("Вашего персонажа зовут Фриск.")
input
print("Ребёнок, которой пропал безвести.")
input
print("Он отправился на гору Эббот.")
input
print("Там вы нашли пещеру в которой была огромная дыра.")
input
print("Когда ребёнок подходил к дыре, он споткнулся об корни которые вели в пустоту.")
input
print("Одним неловким движением дитя падает в неизместность.")
input
print("Дитё просыпается на не большой лужайке жёлтых цветов.")
input
print("С этого начинается настоящее путешествие дитя.")
input
print("То путешевствие, о котором никто не мог подозревать.")
input
print("Данное место называется (Подземелье), в котором проживают существа.")
input
print("Эти существа целиком и полностью состоят из магии.")
input
print("Они имеют разные оболочки в зависимости от типа магии и характера.")
input
print("Сужествуют исключения, которые заметно во время приключения.")
input
print("Вы проживёте один из дней довольно не радостной жизни.")
input
print("Ведь в этом месте явно не все дружелюбные.")
input
print("И не факт, что у всех хорошее прошлое или будующее?")
input
print("Постарайтесь выжить и не забыть свою цель.")
input
print("А то история местами заставит вас задуматься.")
input

def level_one():
    print("утро.")
    print("Ваш весёлый скеледруг Санс стоит на кухне и готовит завтрак к сегодняшнему утру.")
    print("- Хэй, малая, не правдали сегодня хороший день?")
    print("В вашей голове пролетает мгновение, но вы чувствуете опастность, она исходила за вашей спиной.")
    choice = input("1. Обернуться\n2. Промолчать\n3. Сказать Доброе утро\n")
    if choice == "1":
        print("Вы решили обернуться. Скелет стоял сзади вас и вы почуствовали холод. (проигрыш)")
        level_one()
    elif choice == "2":
        print("- Это тебе за Папса. (проигррыш)")
        level_one()
    elif choice == "3":
        print("Скелет вышел из-за вашей спины и вернулся на кухню.")
        level_two()
    else:
        level_one()


def level_two():
    print("Вы заметили, что вы не в безопастности.")
    key_action = random.choice(["1", "2", "3"])
    choice = input(f"что выберете? (дело удачи) \n1. спрятаться\n2. бездействовать\n3. Побеседовать\n")

    if choice == key_action:
        print("Вы остались в живых")
        level_three()
    else:
        print("Попробуйте еще раз.")
        level_two()

def level_three():
    print("вы знаете, что он способен мгновенно перемещаться и в запасе имеет телесную магию, но так же он способен на пощаду.")
    choice = input("1. позвать на прогулку\n2. отпроситься побыть в комнате\n3. Попытаться напасть\n")
    if choice == "1":
        print("вы собрались на улицу!")
        level_four()
    elif choice == "2":
        print("ему не понравилась ваша идея.")
        level_three()
    elif choice == "3":
        print("Вы попытались выбраться самостоятельно и лишились жизни.")
        level_three()
    else:
        level_three()


def level_four():
    print("вы вышли на улицу")
    choice = input("1. побежать\n2. идти спокойно\n3. пошутить\n")
    if choice == "1":
        print("вы погибли от магии.")
        level_four()
    elif choice == "2":
        print("вы спокойно дошли до Грилбис.")
        level_five()
    elif choice == "3":
        print("он поддержал вашу шутку и вы со смехом дошли до Грилбис.")
        level_five()
    else:
        level_four()


def level_five():
    print("В баре вам предложили выбор еды из: картошки фри, бургера и хот-кета")
    object = input("1. выбрать картошку фри\n2. выбрать бургер\n3. выбрать кот-кет\n")
    if object == "1":
        print("вы получили картошку фри")
    elif object == "2":
        print("вы получили бургер")
    elif object == "3":
        print("вы получили хот-кет")
    else:
        level_five()
    level_six()

def level_six():
    print("Санс решил с вами заговорить.")
    print("Он хотел узнать у вас несколько моментов.")
    print("Были странные чувства о которых он хотел поговорить.")
    print("- Хэй Фриск, можем обсудить пару моментов?")
    print("*Вы кивнули головой*")
    print("С сегодняшнего утра, я при себе имею какое-то странное чувство")
    print("Создаётся ощущение будто ты что-то сделала нечто ужасное, за что нет прощения.")
    print("Будто за любое твоё неправильное действие я готов лишить тебя жизни.")
    print("Скажи мне, ты делала сбросы мира?")
    choice = input(
        "1. Я понятия не имею о чём ты (ложь)\n2.Да, я сделала это, из-за того, что что-то непонятное в прошлом таймлайне меняло мир.\n")

    if choice == "1":
        print(
            "вы рассказали скелету не правду. Всё прошло спокойно. Только маленький цветок в углу бара широко улыбнулся и исчез.")
    elif choice == "2":
        print(
            "Скелет вас внимательно выслушал и принял информацию. Вы поели свой обед и спокойно, как обычно, продолжили свой путь.")
    else:
        level_six()



    print("Не смотря на ваши выборы, как бы не хотели, но у вас была способность возвращаться назад. Даже ваша смерть являлась перезапуском таймлайна.")

def game():
    print("Добро пожаловать в short-under!")


if __name__ == "__main__":
    level_one()

list_of_items = ["Нож"]
["Золотой кулон в виде сердца"]
["Снежок"]
["Ирисковый торт"]

dict_of_items = {
    "картошка фри": [1],
    "бургер": [2],
    "хот-кет": [3],
}